In [ ]:
import sqlite3

In [ ]:
# Create connection
conn = sqlite3.connect('school.db')
cursor = conn.cursor()

In [ ]:
# Create tables
cursor.execute('''CREATE TABLE IF NOT EXISTS students ( id INTEGER PRIMARY KEY AUTOINCREMENT, name TEXT, age INTEGER, gender TEXT )''')
cursor.execute('''CREATE TABLE IF NOT EXISTS courses ( id INTEGER PRIMARY KEY AUTOINCREMENT, name TEXT, credits INTEGER )''')
cursor.execute('''CREATE TABLE IF NOT EXISTS enrollments ( id INTEGER PRIMARY KEY AUTOINCREMENT, student_id INTEGER, course_id INTEGER, grade REAL, FOREIGN KEY(student_id) REFERENCES students(id), FOREIGN KEY(course_id) REFERENCES courses(id) )''')

In [ ]:
# Insert sample data

cursor.executemany('INSERT INTO students (name, age, gender) VALUES (?, ?, ?)', [

('Alice', 22, 'F'),

('Bob', 20, 'M'),

('Charlie', 23, 'M')

])


cursor.executemany('INSERT INTO courses (name, credits) VALUES (?, ?)', [

('Math', 3),

('Science', 4),

('History', 2)

])


cursor.executemany('INSERT INTO enrollments (student_id, course_id, grade) VALUES (?, ?, ?)', [

(1, 1, 85),

(1, 2, 90),

(2, 1, 78),

(3, 3, 88)

])


conn.commit()

In [ ]:
cursor.execute('SELECT * FROM students')

In [ ]:
print(cursor.fetchall())

[(1, 'Alice', 22, 'F'), (2, 'Bob', 20, 'M'), (3, 'Charlie', 23, 'M'), (4, 'David', 21, 'M'), (5, 'Alice', 22, 'F'), (6, 'Bob', 20, 'M'), (7, 'Charlie', 23, 'M')]

In [ ]:
cursor.execute('INSERT INTO students (name, age, gender) VALUES (?, ?, ?)', ('David', 21, 'M'))
conn.commit()

In [ ]:
cursor.execute('SELECT * FROM students WHERE age > 21')
print(cursor.fetchall())

[(1, 'Alice', 22, 'F'), (3, 'Charlie', 23, 'M'), (5, 'Alice', 22, 'F'), (7, 'Charlie', 23, 'M')]

In [ ]:
# Retrieve students with grades between 80 and 90

cursor.execute('''SELECT s.name, e.grade

FROM students s

JOIN enrollments e ON s.id = e.student_id

WHERE e.grade BETWEEN 80 AND 90''')

print(cursor.fetchall())

[('Alice', 85.0), ('Alice', 90.0), ('Charlie', 88.0), ('Alice', 85.0), ('Alice', 90.0), ('Charlie', 88.0)]

In [ ]:
# Total credits for each course

cursor.execute("SELECT name, credits FROM courses")

print(cursor.fetchall())

[('Math', 3), ('Science', 4), ('History', 2), ('Math', 3), ('Science', 4), ('History', 2)]

In [ ]:
cursor.execute('''
  SELECT s.name
  FROM students s
  JOIN enrollments e ON s.id = e.student_id
  JOIN courses c ON e.course_id = c.id
  WHERE c.name = 'Math' AND e.grade > 80
''')
print(cursor.fetchall())

[('Alice',), ('Alice',)]

In [ ]:

cursor.execute('''
    SELECT s.name, COUNT(e.course_id) AS num_courses
    FROM students s
    JOIN enrollments e ON s.id = e.student_id
    GROUP BY s.id
''')
print(cursor.fetchall())

[('Alice', 4), ('Bob', 2), ('Charlie', 2)]